In [1]:
my_dictionary = {
    "name": "person 1",
    "age":35,
    "salary":400
}

In [2]:
print(my_dictionary)

{'name': 'person 1', 'age': 35, 'salary': 400}

In [10]:
my_dictionary = {
    "name":["person 1", "person 2","person 3","person 4","person 5"],
    "age":[35,100,34,456,67],
    "salary":[400,500,500,560,750],
}

In [11]:
my_dictionary

{'name': ['person 1', 'person 2', 'person 3', 'person 4', 'person 5'],
 'age': [35, 100, 34, 456, 67],
 'salary': [400, 500, 500, 560, 750]}

In [53]:
my_dictionary['location']=['mombasa','kisumu','nakuru','eldoret','busia']

In [54]:
my_dictionary

{'name': ['person 1', 'person 2', 'person 3', 'person 4', 'person 5'],
 'age': [35, 100, 34, 456, 67],
 'salary': [400, 500, 500, 560, 750],
 'location': ['mombasa', 'kisumu', 'nakuru', 'eldoret', 'busia']}

In [55]:
for key, value in my_dictionary.items():
    print(key, value)

name ['person 1', 'person 2', 'person 3', 'person 4', 'person 5']
age [35, 100, 34, 456, 67]
salary [400, 500, 500, 560, 750]
location ['mombasa', 'kisumu', 'nakuru', 'eldoret', 'busia']

In [36]:
import pandas as pd

In [110]:
my_dictionary

{'name': ['person 1', 'person 2', 'person 3', 'person 4', 'person 5'],
 'age': [35, 100, 34, 456, 67],
 'salary': [400, 500, 500, 560, 750],
 'location': ['mombasa', 'kisumu', 'nakuru', 'eldoret', 'busia']}

In [111]:
df = pd.DataFrame(my_dictionary)

In [112]:
df

       name  age  salary location
0  person 1   35     400  mombasa
1  person 2  100     500   kisumu
2  person 3   34     500   nakuru
3  person 4  456     560  eldoret
4  person 5   67     750    busia

In [113]:
df[["name","age"]]

       name  age
0  person 1   35
1  person 2  100
2  person 3   34
3  person 4  456
4  person 5   67

In [115]:
df["age"]+1

0     36
1    101
2     35
3    457
4     68
Name: age, dtype: int64

In [116]:
df["name"]+"s"

0    person 1s
1    person 2s
2    person 3s
3    person 4s
4    person 5s
Name: name, dtype: object

In [117]:
df.dtypes

name        object
age          int64
salary       int64
location    object
dtype: object

In [98]:
def numberchecker(x):
   
    for x in range(2):
        if num%2==0:
            print("even")
        else:
            print("odd")

num = int(input("enter number"))
numberchecker(num)

enter number 6

even
even

In [118]:
df["age"] = df["age"]+1

In [119]:
df

       name  age  salary location
0  person 1   36     400  mombasa
1  person 2  101     500   kisumu
2  person 3   35     500   nakuru
3  person 4  457     560  eldoret
4  person 5   68     750    busia

In [120]:
for x in range(2):
    def check (number):
        for item in number:
            if item%2==0:
                print('even')
            else:
                print('odd')

    numbers=int(input())
    check({numbers})

 7

odd

 9

odd

In [124]:
df["age"], df["salary"] = df["age"]+1, df["salary"]+500

In [125]:
df

       name  age  salary location
0  person 1   37     900  mombasa
1  person 2  102    1000   kisumu
2  person 3   36    1000   nakuru
3  person 4  458    1060  eldoret
4  person 5   69    1250    busia